---
kind: other
id: Methods.T:Autodesk.Revit.DB.CategorySetIterator
source: html/fdab231d-cfb4-ea17-e161-4831d23832e5.htm
---
# CategorySetIterator Methods

Causes the object to release immediately any resources it may be utilizing.